# SQLite/ sqlite with Pandas

**1.SQLite**
     
     1)it is a relational database management system based on SQL language
     2)it is self-contained,serverless and zero-configuration
     3)it is very fast and lightweight, and the entire database is stored in a single disk file
     4)the lite in SQLite means light weight in terms of setup,database administration and required resource.
     5)it is used in a lot of applications as internal data storage

**2.DB browser**

    DB browser help us to see the databases being created and edited in real time.
    1)open DB
    2)open database
    3)browse data

**3.connect with DB**

     **3.1 create database**

In [26]:
import sqlite3
database=sqlite3.connect('School.sqlite')
database

In [27]:
cur=database.cursor()
cur

In [28]:
sql_query = 'create table Students1(Rollnumber int primary key,Name Text,Age int)'
cur.execute(sql_query)

In [29]:
cur.execute('Insert into Students1 values (101, "Aman", 20)')

In [30]:
database.commit()

In [31]:
cur.execute('Insert into Students1 values (102, "Aman", 21)')

In [32]:
database.commit()

In [33]:
database.close()

     **3.2 passing parameters in query**

In [34]:
import sqlite3
database=sqlite3.connect('School.sqlite')
database

In [35]:
cur=database.cursor()
cur

In [36]:
cur.execute('Insert into Students1 values (103, "Mohit", 24)')

In [37]:
database.commit()

In [40]:
#method 1: add rows
Rollnumber=104
Name ='Nikhil'
Age=34

cur.execute("Insert into Students1 values(?,?,?)",(Rollnumber,Name,Age))

In [41]:
database.commit()

In [42]:
#method 2: add rows
values = [(205,'Nidhi',20),(106,"Manisha",21),(107,"Ankush",22)]
cur.executemany("Insert into Students1 values(?,?,?)",values)

In [43]:
database.commit()

     **3.3 update the database**

In [44]:
cur.execute('Update Students1 set age=30')

In [45]:
database.commit()

In [47]:
cur.execute('Update Students1 set age=20 where rollnumber=102')

In [48]:
database.commit()

In [49]:
new_age=50
cur.execute('Update Students1 set age=? where rollnumber=103',(new_age, ))
database.commit()

**Exercise 1**

    A given data of 12 Employees working in an investment firm. So add the Employee Data in Employee SQLite Database of Employee_Detail Table which was created by you.
    
        1)employee_id=[101,102,103,104,105,106,107,108,109,110,111,112,113]
    
        2)name=['Aadarsh','Aarti','Siddharth','Aman','Amit','Shivansh','Vaibhav','Himanshu','Raman','Kunal','Adhira','Tanya']
    
        3)age=[25,27,25,24,30,26,23,26,25,26,29,24]
    
        4)department=['Marketing','Operations','Finance','Human Resource','Marketing','IT','Finance','IT','Operations','Marketing','Human Resource','Marketing']
    
        5)salary=[50000,60000,85000,75000,50000,90000,85000,90000,60000,50000,75000,50000]

In [56]:
employee_id=[101,102,103,104,105,106,107,108,109,110,111,112,113]
name=['Aadarsh','Aarti','Siddharth','Aman','Amit','Shivansh','Vaibhav','Himanshu','Raman','Kunal','Adhira','Tanya']
age=[25,27,25,24,30,26,23,26,25,26,29,24]
department=['Marketing','Operations','Finance','Human Resource','Marketing','IT','Finance','IT','Operations','Marketing','Human Resource','Marketing']
salary=[50000,60000,85000,75000,50000,90000,85000,90000,60000,50000,75000,50000]

In [57]:
l=[]
for i in range(len(name)):
    l.append([employee_id[i],name[i],age[i],department[i],salary[i]])

In [58]:
import sqlite3
database=sqlite3.connect('Employees.sqlite')
cur=database.cursor()
sql_query = 'create table Employee_Detail (employee_id int primary key,name Text,Age int,department text,salary int)'
cur.execute(sql_query)
cur.executemany("Insert into Employee_Detail values(?,?,?,?,?)",l)
database.commit()

**4.Fetch data**

In [63]:
import sqlite3
database=sqlite3.connect('School.sqlite')
database

In [64]:
cur=database.cursor()
cur

     **4.1 method 1**

In [65]:
cur.execute('select * from Students1')

In [66]:
for row in cur:
    print(row)

(101, 'Aman', 30)
(102, 'Aman', 20)
(103, 'Mohit', 50)
(104, 'Nikhil', 30)
(205, 'Nidhi', 30)
(106, 'Manisha', 30)
(107, 'Ankush', 30)

     **4.2 method 2**

In [68]:
cur.execute('select * from Students1')
print(cur.fetchone())
print(cur.fetchone())
print(cur.fetchone())

(101, 'Aman', 30)
(102, 'Aman', 20)
(103, 'Mohit', 50)

     **4.3 method 3**

In [71]:
cur.execute('select * from Students1')
print(cur.fetchmany())

[(101, 'Aman', 30)]

In [70]:
cur.execute('select * from Students1')
print(cur.fetchmany(3))

[(101, 'Aman', 30), (102, 'Aman', 20), (103, 'Mohit', 50)]

In [73]:
cur.execute('select * from Students1 where rollnumber>103')
print(cur.fetchmany(3))

[(104, 'Nikhil', 30), (106, 'Manisha', 30), (107, 'Ankush', 30)]

     **4.4 method 4**

In [72]:
cur.execute('select * from Students1')
ans=cur.fetchall()
ans

[(101, 'Aman', 30),
 (102, 'Aman', 20),
 (103, 'Mohit', 50),
 (104, 'Nikhil', 30),
 (205, 'Nidhi', 30),
 (106, 'Manisha', 30),
 (107, 'Ankush', 30)]

In [74]:
cur.execute('select * from Students1 where name like "A%"')
ans=cur.fetchall()
ans

[(101, 'Aman', 30), (102, 'Aman', 20), (107, 'Ankush', 30)]

**Exercise 2**

    Find the employee_id of employee whose is working in Finance Department in Investment firm from Employee SQLite Database.
    Print the employee_id as integer value

Output Format:

    employee_id_1
    employee_id_2
    .  .  .

In [78]:
import sqlite3
database=sqlite3.connect('Employees.sqlite')
cur=database.cursor()
cur.execute('select * from Employee_Detail where department="Finance"')
ans=cur.fetchall()
for i in ans:
    print(i[0])

103
107

**Exercise 3. Find Employee**

    Find number of employee working in different department in an investment firm from Employee SQLite Database.
    Print the department and number of employee

Output Format:

    department_1 num_employee_1
    department_2 num_employee_2
    department_3 num_employee_3

In [85]:
cur.execute('select department,count(*) from Employee_Detail group by department ')
ans=cur.fetchall()
ans
for i in ans:
    print(i[0],i[1])

Finance 2
Human Resource 2
IT 2
Marketing 4
Operations 2

**5.SQLite with pandas**

             **using pandas to convert database to dataframe

In [115]:
import sqlite3
import pandas as pd
database=sqlite3.connect('School.sqlite')

In [116]:
data=pd.read_sql_query('select * from students1',database)
data

   Rollnumber     Name  Age
0         101     Aman   30
1         102     Aman   20
2         103    Mohit   50
3         104   Nikhil   30
4         205    Nidhi   30
5         106  Manisha   30
6         107   Ankush   30

In [89]:
data['Age']==30

0     True
1    False
2    False
3     True
4     True
5     True
6     True
Name: Age, dtype: bool

             **using pandas to convert dataframe to database**

In [92]:
data=pd.DataFrame([[201,"Aman","English",20000],[202,"Komal",'Maths',22000],[203,"Mahesh","Science",23000]], 
                  columns=["ID","Name","Course","Salary"])
data

    ID    Name   Course  Salary
0  201    Aman  English   20000
1  202   Komal    Maths   22000
2  203  Mahesh  Science   23000

In [94]:
data.to_sql("Faculties",database)

In [ ]:
#data.to_sql('Student',database,if_exists='replace')

**Exercise 3.Count Genre**

    IMDB.sqlite' database contains all details of movies and has three tables with name IMDB, genre and earning.
    Find the count of each genre present in IMDB movie dataset?
    Print the Genre and number of movies present in that genre.
    Note: Ignore the empty value present in genre.

Output Format:

    genre_1 num_movie_1
    genre_2 num_movie_2

In [117]:
import sqlite3
import pandas as pd

In [149]:
database=sqlite3.connect('IMDB.sqlite')
data=pd.read_sql_query('select genre,count(*) as number from genre group by genre',database)
m=len(data['genre'])

In [157]:
for i in range(1,m):
    if data['genre'][i]==' ':
        continue
    else:
        print(data['genre'][i],data['number'][i])

Action 33
Adventure 43
Animation 13
Biography 21
Comedy 31
Crime 11
Drama 77
Family 3
Fantasy 7
History 6
Horror 2
Music 3
Musical 1
Mystery 7
Romance 13
Sci-Fi 18
Sport 3
Thriller 14
War 2
Western 2

**Exercise 4.IMDB Movie**

    IMDB.sqlite' database contains all details of movies and has three tables with name IMDB, genre and earning.
    Find the highest-grossing movie (i.e domestic earning + worldwide earning) in IMDB database.
    Print the rating of that movie.

Output Format:
    
    rating

In [179]:
import sqlite3
import pandas as pd
import numpy as np
database=sqlite3.connect('IMDB.sqlite')
data=pd.read_sql_query('select earning.Movie_id,IMDB.Rating,Domestic,Worldwide from earning inner join IMDB on earning.Movie_id=IMDB.Movie_id ',database)
data['Grossing']=data['Domestic']+data['Worldwide']
data.head()
data.to_sql('earning',database,if_exists='replace')
data=pd.read_sql_query('select Rating,Grossing from earning order by Grossing desc',database)
print(data['Rating'][0])

8.1